

#+begin_src shell :results verbatim
  grep -P -o '(\w+)' asts/dungeon.js.out |sort |uniq -c |sort -n
#+end_src

#+RESULTS:
#+begin_example
      1 1000
      1 1E3
      1 all
      1 bevel_nw
      1 bevel_se
      1 box
      1 cache_pixels
      1 call
      1 charCodeAt
      1 complex_id
      1 cross
      1 dagger
      1 desc
      1 dimin
      1 directive
      1 document
      1 drawImage
      1 draw_pixels
      1 draw_string
      1 fill_grid
      1 fine
      1 fromCharCode
      1 generate_text
      1 getContext
      1 hover
      1 insert
      1 keep
      1 labyrinth
      1 last_door
      1 new_image
      1 no
      1 print
      1 Program
      1 quasis
      1 save_canvas
      1 script
      1 seed
      1 select_from_table
      1 set_prng_seed
      1 sourceType
      1 String
      1 TemplateLiteral
      1 tiny
      1 unshift
      1 void
      2 1008
      2 101
      2 110
      2 12648415
      2 1270
      2 13
      2 20
      2 200
      2 21
      2 252
      2 255
      2 2d
      2 30
      2 31
      2 318
      2 33
      2 40
      2 400
      2 4128768
      2 4128769
      2 4194304
      2 504
      2 57735
      2 635
      2 76
      2 800
      2 8388608
      2 9
      2 91
      2 999
      2 Aa
      2 All
      2 allDirectionsList
      2 Archway
      2 b6def2
      2 base_layer
      2 basic
      2 Basic
      2 blocked
      2 Box
      2 c9ebf5
      2 calculatePotentialStairLocations
      2 canvas
      2 cccccc
      2 classic
      2 Classic
      2 colorFallbackChain
      2 colossal
      2 configSettingsForDungeonGeneration
      2 ContinueStatement
      2 cooked
      2 corridorCreationConditions
      2 Cross
      2 Dagger
      2 deathtrap
      2 Deathtrap
      2 Dense
      2 Diminiutive
      2 dom
      2 doorData
      2 drawDoorsOrFeaturesBetweenAdjacentRooms
      2 drawDownStairs
      2 drawStairs
      2 drawUpStairs
      2 Dungeon
      2 dungeon_title
      2 Element
      2 ensureConsistentRoomConnections
      2 Errant
      2 exportMapImage
      2 Fine
      2 font
      2 gargant
      2 getColorPalette
      2 graph
      2 GraphPaper
      2 H
      2 Hex
      2 Hexagon
      2 hjkl
      2 initializeStairInfo
      2 isComplexRoomEnabled
      2 join
      2 Keep
      2 Labyrinth
      2 large
      2 layoutType
      2 loaded
      2 Lock
      2 Locked
      2 Many
      2 max_col
      2 max_row
      2 middleColumn
      2 middleRow
      2 Name
      2 NewExpression
      2 new_name
      2 next_col
      2 No
      2 numMediumSizeRoomsToAdd
      2 numRoomsToAdd
      2 oppositeDirection
      2 oppositeDirectionsMap
      2 option
      2 png
      2 Portcullis
      2 pow
      2 print_map
      2 px
      2 Rectangle
      2 roomLayoutConfig
      2 roomSizeConfig
      2 Round
      2 sa
      2 Saltire
      2 sans
      2 save_map
      2 Scattered
      2 Secret
      2 secure
      2 Secure
      2 serif
      2 setValue
      2 shuffleDirections
      2 sill_c
      2 sill_r
      2 small
      2 Some
      2 Sparse
      2 splice
      2 sqrt
      2 stairDimensions
      2 Straight
      2 stroke_rect
      2 ta
      2 tag
      2 tail
      2 targetRoom
      2 TemplateElement
      2 Tiny
      2 toString
      2 Trapped
      2 Unlocked
      2 va
      2 VertHex
      2 wall_shading
      2 window
      2 x1
      2 xa
      2 y1
      2 ya
      2 Yes
      2 za
      3 abs
      3 calculatePotentialDoorConnections
      3 calculateRoomCount
      3 calculateStairOffsets
      3 concat
      3 da
      3 defaultDungeonConfig
      3 dense
      3 dir
      3 door_c
      3 door_r
      3 dungeonConfigSettings
      3 dungeonStateConfiguration
      3 flags
      3 generateCorridors
      3 ha
      3 hex
      3 hexagon
      3 ia
      3 isHugeRoomEnabled
      3 ja
      3 len
      3 many
      3 next_row
      3 open_grid
      3 optionalPreferredDirection
      3 pattern
      3 rectangle
      3 regex
      3 removeDeadEnd
      3 removeDeadEnds
      3 roomConnections
      3 roomIndex
      3 round
      3 saltire
      3 scattered
      3 set_pixel
      3 some
      3 sparse
      3 straight
      3 straight_pct
      3 strict
      3 updateDungeonConfiguration
      3 updateDungeonTitle
      3 use
      3 vex
      3 windowObject
      4 10
      4 12582912
      4 17
      4 24
      4 32
      4 333333
      4 3399cc
      4 4641016151
      4 50
      4 61
      4 65472
      4 90
      4 allDoors
      4 change
      4 close_arcs
      4 Colossal
      4 currentColumnIndex
      4 currentMediumSizeRoomBeingAdded
      4 currentRoomToAdd
      4 currentRowIndex
      4 dungeon_size
      4 Gargantuan
      4 getValue
      4 Huge
      4 inputObject
      4 LabeledStatement
      4 Large
      4 map
      4 mappedRoomConnections
      4 Medium
      4 numberOfDoors
      4 potentialDoorConnections
      4 remove_pct
      4 shift
      4 Small
      4 square
      4 Square
      4 stairPlacementRules
      4 stairsConfig
      4 Standard
      4 tread
      4 up
      4 yc
      5 addRoomToDungeon
      5 add_stairs
      5 black
      5 canDoorBePLaced
      5 close
      5 colorPalettes
      5 corridor
      5 CurrColIndex
      5 doorType
      5 drawMap
      5 dungeonLayout
      5 eastBoundary
      5 errant
      5 getColorFromPalette
      5 initHandler
      5 map_style
      5 mask
      5 max_x
      5 max_y
      5 midpointRowCoord
      5 next
      5 recurse
      5 southBoundary
      5 subCriteria
      5 westBoundary
      5 white
      5 yes
      6 000000
      6 2097152
      6 60
      6 666666
      6 75
      6 8
      6 BreakStatement
      6 calculatedStairOffsets
      6 cellSizeRoomHeightDimensions
      6 click
      6 colorKey
      6 compositeMapLayer
      6 connectedDoors
      6 corridor_layout
      6 directionRowOffsets
      6 doorDirection
      6 dungeonLayoutObject
      6 huge
      6 in
      6 inputDungeon
      6 list
      6 N
      6 none
      6 None
      6 n_rooms
      6 observe
      6 portc
      6 remove_deadends
      6 room_layout
      6 rowIdxForCurrDirection
      6 secret
      6 sort
      6 table
      6 trap
      6 xc
      7 bCorridorCanBeCreatedCurrDir
      7 currentDungeonConfig
      7 directionColumnOffsets
      7 dungeon
      7 dungeon_layout
      7 lock
      7 northBoundary
      7 stairInfo
      7 style
      8 1048576
      8 262144
      8 34
      8 524288
      8 colIndexForCurrentDirection
      8 colNum
      8 colors
      8 complex
      8 Door
      8 down
      8 dungeonObject
      8 dungeonStateWithoutWallFlags
      8 getDungeonConfigConstant
      8 midpointColCoord
      8 n_i
      8 n_j
      8 out_id
      8 pct
      8 potentialDoorLocations
      8 radix
      8 room_size
      8 rowNum
      8 side
      9 applyShading
      9 col
      9 colorPalette
      9 currentDungeonLayoutObj
      9 currentRoom
      9 deadEndRemovalRules
      9 doors
      9 dungeonLayout2DGrid
      9 fill_rect
      9 newColIdxAfterMovingCurrDir
      9 newRowIdxAfterMovingCurrDir
      9 Object
      9 open
      9 wall
      9 walled
     10 01
     10 100
     10 131072
     10 15
     10 aspect
     10 dungeon_name
     10 ffffff
     10 i
     10 j
     10 roomId
     10 roomIdIterator
     10 row
     10 stair
     10 standard
     11 arch
     11 canvasDrawingContext
     11 keys
     11 length
     11 roomCriteria
     11 stairColumn
     12 B
     12 fill
     12 medium
     12 potentialDoor
     14 65536
     14 cell_size
     14 dungeonConfigConstants
     14 dungeonStateWithStairs
     14 east
     14 height
     14 north
     14 room
     14 south
     14 west
     14 width
     15 grid
     15 push
     15 random
     15 rowIndex
     16 4
     16 colIndex
     16 dungeonConfigObject
     16 label
     17 A
     17 G
     17 t
     18 18
     18 5
     18 applyWallShading
     18 doorRow
     20 16
     20 E
     20 n_cols
     20 n_rows
     22 D
     22 forEach
     22 palette
     22 selectedDoorStyle
     22 stairObject
     25 C
     25 floor
     25 size
     25 z
     26 ArrowFunctionExpression
     27 dungeonDimensions
     27 n
     27 roomHeight
     28 door
     32 dungeonState
     32 Math
     33 y
     34 FunctionDeclaration
     36 draw_line
     36 mapStyleInfo
     38 3
     39 m
     40 ConditionalExpression
     40 v
     41 SequenceExpression
     41 w
     42 expressions
     42 ReturnStatement
     43 q
     44 dungeonConfig
     44 x
     45 p
     46 r
     48 k
     49 title
     50 u
     50 var
     51 UpdateExpression
     56 6
     58 adjacentRoomId
     59 f
     60 async
     60 generator
     60 params
     62 h
     63 ForStatement
     65 IfStatement
     65 update
     68 l
     75 d
     88 UnaryExpression
     93 b
     95 cell
     96 g
    101 e
    101 LogicalExpression
    105 alternate
    105 consequent
    108 let
    115 ObjectExpression
    115 properties
    119 c
    133 ArrayExpression
    133 elements
    133 null
    139 prefix
    149 BlockStatement
    158 2
    158 declarations
    158 VariableDeclaration
    171 test
    181 argument
    202 a
    236 ExpressionStatement
    251 VariableDeclarator
    277 body
    279 CallExpression
    281 arguments
    281 callee
    296 expression
    316 id
    317 AssignmentExpression
    321 method
    321 Property
    321 shorthand
    334 true
    336 key
    377 0
    479 kind
    564 BinaryExpression
    635 init
    668 1
    829 MemberExpression
    829 object
    829 property
    938 Literal
    940 raw
    982 left
    982 right
   1121 operator
   1150 computed
   1262 value
   1779 false
   3483 Identifier
   3483 name
   8348 type
#+end_example
     20 n_cols
     20 n_rows

          18 applyWallShading
     18 doorRow
     16 dungeonConfigObject
          15 rowIndex
     16 4
     16 colIndex

22 palette
     22 selectedDoorStyle
     22 stairObject
     25 C
     25 floor
     25 size

     27 dungeonDimensions
     27 roomHeight
     28 door
     32 dungeonState
     36 mapStyleInfo
     44 dungeonConfig
*
#  grep -n -H -C100 dungeonConfig asts/dungeon.js.out  > dungeonConfig.txt
#+begin_src shell :results verbatim

  csplit -z  -f "asts/DUNGEON-" -b "%07d.txt" dungeonConfig.txt  /\"type/ {*}
#+end_src 

#+RESULTS:
#+begin_example
226
151
146
227
154
350
509
397
517
143
138
738
123
300
172
184
209
150
291
154
643
196
221
158
303
538
221
158
304
162
393
395
491
158
306
162
393
399
672
159
233
239
307
366
239
308
454
159
233
239
307
369
239
310
457
159
233
239
307
356
453
159
233
239
307
353
393
145
230
366
239
307
421
214
226
251
178
343
614
251
178
691
166
263
329
467
259
329
269
347
469
264
479
244
269
190
355
289
295
462
455
593
190
745
178
281
353
503
277
353
287
371
505
282
515
262
287
202
379
307
313
492
485
882
203
297
303
307
316
322
329
427
506
493
480
564
309
315
320
502
495
320
502
579
313
492
214
505
932
297
317
408
214
515
415
324
221
551
867
221
551
1307
315
321
328
335
435
720
325
334
340
347
451
536
523
510
686
323
416
218
525
423
330
225
561
883
225
561
883
225
564
2281
181
266
340
716
217
229
254
180
348
622
254
180
347
184
442
569
180
710
168
266
343
473
262
343
408
267
495
185
272
349
184
440
1315
180
284
382
509
280
382
448
285
546
197
290
373
196
470
380
297
203
509
1729
181
266
340
863
199
224
160
314
542
161
236
308
402
224
160
618
148
236
301
413
233
301
242
318
419
237
433
157
287
223
248
176
706
125
294
175
200
144
263
213
147
369
160
377
168
260
176
405
584
1254
145
140
218
148
230
288
401
412
380
283
334
211
169
248
253
315
375
168
260
176
405
475
1182
200
144
263
148
358
366
408
471
228
233
371
242
299
425
236
288
160
366
727
139
601
125
295
223
274
175
139
211
217
288
318
217
267
717
125
273
223
274
175
200
144
263
220
230
283
340
226
238
295
355
505
146
267
720
245
250
256
263
327
396
399
370
741
141
612
127
294
227
279
178
147
215
260
220
227
300
341
225
276
233
287
543
147
215
260
217
223
231
239
295
353
408
231
239
295
354
462
473
147
156
146
267
225
276
547
147
215
260
349
147
213
221
271
323
221
227
279
333
227
279
479
203
146
267
226
233
308
351
233
287
440
146
267
225
233
287
343
602
147
215
260
219
227
279
334
473
133
214
218
348
447
257
334
174
416
341
271
354
280
369
481
271
357
280
372
481
1186
141
630
127
293
247
304
178
190
215
154
283
158
245
319
722
215
154
578
142
227
276
229
239
295
355
461
223
342
334
166
307
256
319
626
167
245
250
311
370
250
311
479
167
245
250
311
370
669
147
213
219
225
301
233
307
405
223
154
355
480
233
307
457
146
227
279
398
496
141
612
127
308
279
178
203
146
267
227
279
376
146
267
319
146
424
286
178
198
324
196
145
232
293
352
157
238
301
533
159
233
291
238
312
608
141
690
127
283
245
243
238
298
178
133
212
334
221
289
378
137
218
342
227
297
390
202
227
162
299
251
327
616
163
239
310
241
300
559
163
240
292
467
227
162
299
247
257
335
384
253
392
698
163
239
308
241
251
327
375
465
227
162
614
150
239
292
419
235
292
351
240
426
220
245
174
323
265
271
422
410
475
174
323
265
332
475
174
323
265
332
271
422
553
174
323
271
828
162
257
316
455
253
316
397
258
462
238
263
186
347
283
356
493
186
347
283
356
268
528
194
458
382
363
363
363
363
687
186
438
366
347
347
347
347
1127
141
224
352
233
305
402
146
225
245
300
251
327
429
245
318
247
308
495
246
300
445
245
300
247
257
335
384
439
245
316
247
257
335
385
253
392
493
245
300
545
229
284
357
234
414
150
231
251
308
253
259
547
253
316
433
251
308
253
316
259
402
507
251
308
561
235
292
351
240
426
167
237
257
316
259
324
463
257
316
259
324
463
175
260
402
265
271
340
410
551
255
182
428
358
339
339
339
339
492
182
428
358
339
339
339
339
639
174
408
342
323
323
323
323
835
208
167
245
318
251
327
487
154
245
300
431
242
300
251
327
435
246
300
377
171
166
388
326
307
383
307
263
343
385
562
154
245
300
431
242
300
251
327
435
246
300
377
171
166
388
326
383
307
263
343
385
307
891
141
214
800
127
288
246
227
227
227
182
432
247
308
836
145
365
235
162
251
314
444
253
316
580
694
145
364
773
203
146
554
134
215
272
371
211
272
221
271
373
216
272
221
271
373
151
221
226
233
287
346
342
150
233
290
408
235
241
312
251
311
432
245
303
672
141
612
127
297
227
239
292
178
203
146
283
482
133
211
272
315
138
213
234
284
239
308
400
154
239
311
419
397
233
296
235
241
312
432
245
316
582
217
268
333
222
268
227
292
385
155
150
233
303
407
500
137
217
280
325
142
219
239
292
241
247
308
444
251
324
482
158
245
319
431
409
240
304
245
316
530
223
276
343
228
276
233
300
397
159
154
239
311
419
672
141
628
127
288
237
239
292
178
133
215
273
316
196
221
158
307
241
251
321
371
251
321
482
158
302
241
251
321
371
251
321
663
159
154
239
245
313
366
422
311
369
232
183
178
418
344
347
331
342
331
1259
196
221
158
307
241
251
321
371
251
321
482
158
302
241
251
321
371
251
321
663
159
154
239
245
313
366
422
311
369
232
183
178
418
344
331
347
331
342
1294
141
214
800
127
290
227
239
292
178
133
215
263
316
196
221
158
307
245
303
591
159
154
239
245
303
366
422
311
380
232
257
182
339
197
287
359
436
190
293
370
526
295
383
305
383
1039
183
178
418
344
277
364
411
342
277
364
411
342
1259
196
221
158
307
245
303
591
159
154
239
245
303
366
422
311
380
232
257
182
339
280
287
359
436
190
293
370
526
295
383
305
383
1039
183
178
418
344
342
277
364
411
342
277
364
411
1294
141
214
800
127
298
178
203
146
267
150
233
158
360
521
680
147
142
330
150
340
463
211
564
702
856
185
134
264
198
137
349
216
149
378
234
161
405
1131
149
377
234
161
405
1129
149
375
234
161
405
407
604
137
344
602
137
344
891
135
130
203
254
350
317
271
196
159
154
239
162
251
316
443
454
422
311
369
232
183
178
275
186
287
364
515
292
388
589
494
359
429
268
293
206
387
317
322
328
436
503
493
810
293
206
387
210
490
647
206
387
317
399
811
207
305
380
206
317
213
506
519
324
221
408
154
239
162
370
535
422
369
468
159
154
239
162
370
527
422
367
461
159
154
239
162
251
316
443
454
422
311
369
232
183
178
275
186
430
505
494
429
1157
159
154
239
162
370
527
422
382
370
529
422
367
319
232
183
178
275
348
1712
185
134
263
437
135
197
203
209
215
284
317
306
294
192
133
407
760
135
197
203
209
215
284
317
307
294
192
133
407
580
133
407
762
135
197
203
209
215
284
317
308
294
192
133
407
580
133
407
582
133
407
762
135
197
203
209
215
284
317
310
294
192
133
407
580
133
407
582
133
407
582
133
407
582
133
409
584
133
411
764
135
197
203
209
215
284
317
311
294
192
133
407
580
133
407
582
133
407
764
185
134
261
198
137
345
216
149
84
#+end_example

dungeonConfig.txt

csplit -z  -f "output/METACOQ-UTILS-GOAL" -b "%07d.txt" build.log  /^Goal:/ {*}


#+begin_src shell :results verbatim
grep type asts/dungeon.js.gron | cut -d= -f2- | sort |uniq -c |sort -n
#+end_src 

#+RESULTS:
#+begin_example
      1  "Program";
      1  "TemplateLiteral";
      2  "ContinueStatement";
      2  "NewExpression";
      2  "TemplateElement";
      4  "LabeledStatement";
      6  "BreakStatement";
      6  "type";
     26  "ArrowFunctionExpression";
     34  "FunctionDeclaration";
     40  "ConditionalExpression";
     41  "SequenceExpression";
     42  "ReturnStatement";
     51  "UpdateExpression";
     63  "ForStatement";
     65  "IfStatement";
     88  "UnaryExpression";
    101  "LogicalExpression";
    115  "ObjectExpression";
    133  "ArrayExpression";
    149  "BlockStatement";
    158  "VariableDeclaration";
    236  "ExpressionStatement";
    251  "VariableDeclarator";
    279  "CallExpression";
    317  "AssignmentExpression";
    321  "Property";
    564  "BinaryExpression";
    829  "MemberExpression";
    938  "Literal";
   3483  "Identifier";
#+end_example

grep MemberExpression asts/dungeon.js.gron -C10 grep MemberExpression asts/dungeon.js.gron -C10

csplit -z  -f "asts/DUNGEON-" -b "%07d.txt" asts/dungeon.js.gron  /MemberExpression/ {*}

#+begin_src shell :results verbatim
for x in asts/DUNGEON-*.txt;
do 
gron -u < $x > $x.json
done

#+end_src

#+RESULTS:


#+begin_src shell

~/experiments/lang_agent/_build/default/bin/scanner.exe  -s asts/ -c .json  -p "Consider this ast from the dungeon generator js script. Please explain the code and identify key concepts:" --openai -m "mixtral" -u "https://dev-hub.agentartificial.com"
#+end_src
